Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/РазрешениеНаОхоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаОхоту</name>
  <basedOn>Catalog.Охотники</basedOn>
  <registerRecords>AccumulationRegister.ДобытаяДичь</registerRecords>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаРазрешений</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевкаДоговор</name>
    <type>
      <types>DocumentRef.ПутевкаДоговор</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктМПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.Заявление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДобытаяДичь</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобычи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/Ограничение/Ограничение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ограничение</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ЦеныПоВидамДичи/ЦеныПоВидамДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоВидамДичи</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСвоимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСвоимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоСезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеОсобыхЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ОграниченияДичиНаДобычу/ОграниченияДичиНаДобычу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграниченияДичиНаДобычу</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаСезон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ограничено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.ГруппыДичи</types>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/ManagerModule.bsl
Процедура ПолучитьТабДок(ТабДок,ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	ЭтоЛицеваяСторона = ПараметрыПечати.ИмяМакета = "ЛицеваяСторона";
	
	Макет 			= Документы.РазрешениеНаОхоту.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Документы.РазрешениеНаОхоту.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	
	Ссылка 			= ПараметрыПечати.Документ;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		 
"ВЫБРАТЬ
|	РазрешениеНаОхоту.МестоОхоты КАК МестоОхотыСсылка,
|	РазрешениеНаОхоту.МестоОхоты.НаименованиеДляПечати КАК МестоОхоты,
|	РазрешениеНаОхоту.Дата КАК Дата,
|	ЕСТЬNULL(РазрешениеНаОхоту.СерияРазрешения, """") КАК Серия,
|	ЕСТЬNULL(РазрешениеНаОхоту.НомерРазрешения, """") КАК Номер,
|	РазрешениеНаОхоту.Ответственный.Представление КАК Исполнитель,
|	РазрешениеНаОхоту.Охотхозяйство.Наименование КАК Охотхозяйство,
|	ЕСТЬNULL(РазрешениеНаОхоту.Охотник, """") КАК Охотник,
|	ЕСТЬNULL(РазрешениеНаОхоту.Охотник.Фамилия, """") КАК Фамилия,
|	ЕСТЬNULL(РазрешениеНаОхоту.Охотник.Имя, """") + "" "" + ЕСТЬNULL(РазрешениеНаОхоту.Охотник.Отчество, """") КАК ИмяОтчество,
|	ЕСТЬNULL(ОхотничьиБилеты.Серия, """") КАК СерияБилета,
|	ЕСТЬNULL(ОхотничьиБилеты.Номер, """") КАК НомерБилета,
|	ЕСТЬNULL(ОхотничьиБилеты.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачи,
|	РазрешениеНаОхоту.Охотхозяйство.СубъектРФ.Наименование КАК СубъектРФ,
|	РазрешениеНаОхоту.СезонОхоты КАК СезонОхоты,
|	РазрешениеНаОхоту.ВидДичи КАК ВидДичи,
|	ЕСТЬNULL(РазрешениеНаОхоту.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
|	ЕСТЬNULL(РазрешениеНаОхоту.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания
|ПОМЕСТИТЬ ВТ1
|ИЗ
|	Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
|		ПО РазрешениеНаОхоту.Охотник = ОхотничьиБилеты.Охотник
|			И (ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ГосБилет))
|			И (ОхотничьиБилеты.Действует)
|ГДЕ
|	РазрешениеНаОхоту.Ссылка В(&Ссылка)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	Ограничение.Дичь КАК Дичь
|ПОМЕСТИТЬ ВТОграничение
|ИЗ
|	РегистрСведений.Ограничение КАК Ограничение
|ГДЕ
|	(Ограничение.СезонОхоты, Ограничение.Охотхозяйство) В
|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
|				Т.СезонОхоты,
|				Т.МестоОхотыСсылка
|			ИЗ
|				ВТ1 КАК Т)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ1.МестоОхоты,
|	ВТ1.Дата,
|	ВТ1.Серия,
|	ВТ1.Номер,
|	ВТ1.Исполнитель,
|	ВТ1.Охотхозяйство,
|	ВТ1.Охотник,
|	ВТ1.Фамилия,
|	ВТ1.ИмяОтчество,
|	ВТ1.СерияБилета,
|	ВТ1.НомерБилета,
|	ВТ1.ДатаВыдачи,
|	ВТ1.СубъектРФ,
|	ВТ1.ДатаНачала,
|	ВТ1.ДатаОкончания
|ИЗ
|	ВТ1 КАК ВТ1
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ ПЕРВЫЕ 1
|	ВТ1.ДатаНачала,
|	ВТ1.ДатаОкончания,
|	ПерваяСтрочкаЦены.КлючСвязи,
|	ПерваяСтрочкаЦены.ВидДичи
|ПОМЕСТИТЬ ВТ2
|ИЗ
|	РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
|			&Дата,
|			СезонОхоты = &СезонОхоты
|				И ВидДичи = &ВидДичи) КАК ПерваяСтрочкаЦены
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
|		ПО (ИСТИНА)
|
|УПОРЯДОЧИТЬ ПО
|	ПерваяСтрочкаЦены.Период
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ2.ДатаНачала,
|	ВТ2.ДатаОкончания,
|	УстановкаОграниченийИЦенСостав.Дичь КАК ВидРесурсов,
|	УстановкаОграниченийИЦенСостав.Ограничено КАК Ограничено,
|	УстановкаОграниченийИЦенСостав.КоличествоВДень КАК КоличествоВДень,
|	УстановкаОграниченийИЦенСостав.КоличествоЗаСезон КАК КоличествоЗаСезон,
|	УстановкаОграниченийИЦенСостав.НомерСтроки КАК НомерСтроки
|ПОМЕСТИТЬ ПерваяСтрочкаСостав
|ИЗ
|	ВТ2 КАК ВТ2
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаОграниченийИЦен.Состав КАК УстановкаОграниченийИЦенСостав
|		ПО ВТ2.КлючСвязи = УстановкаОграниченийИЦенСостав.КлючСвязи
|ГДЕ
|	НЕ УстановкаОграниченийИЦенСостав.Дичь В
|				(ВЫБРАТЬ
|					Т.Дичь
|				ИЗ
|					ВТОграничение КАК Т)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ВТ1.ДатаНачала КАК ДатаНачала,
|	ВТ1.ДатаОкончания КАК ДатаОкончания,
|	ОграниченияДичи.Дичь КАК ВидРесурсов,
|	ОграниченияДичи.Ограничено,
|	ОграниченияДичи.КоличествоВДень,
|	ОграниченияДичи.КоличествоЗаСезон,
|	ОграниченияДичи.НомерСтроки,
|	ОграниченияДичи.КлючСвязи
|ПОМЕСТИТЬ Исходная
|ИЗ
|	ВТ1 КАК ВТ1
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
|				&Дата,
|				СезонОхоты = &СезонОхоты
|					И ВидДичи = &ВидДичи) КАК ЦеныПоВидамДичи
|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОграниченияДичиНаДобычу.СрезПоследних(
|					&Дата,
|					СезонОхоты = &СезонОхоты
|						И ВидДичи = &ВидДичи) КАК ОграниченияДичи
|			ПО ЦеныПоВидамДичи.КлючСвязи = ОграниченияДичи.КлючСвязи
|		ПО (ВЫБОР
|				КОГДА &ТолькоСезонная
|					ТОГДА ВТ1.ДатаНачала = ЦеныПоВидамДичи.ДатаНачала
|							И ВТ1.ДатаОкончания = ЦеныПоВидамДичи.ДатаОкончания
|				ИНАЧЕ ВТ1.ДатаНачала >= ЦеныПоВидамДичи.ДатаНачала
|						И ВТ1.ДатаОкончания <= ЦеныПоВидамДичи.ДатаОкончания
|			КОНЕЦ)
|ГДЕ
|	НЕ ОграниченияДичи.Дичь В
|				(ВЫБРАТЬ
|					Т.Дичь
|				ИЗ
|					ВТОграничение КАК Т)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	ЕСТЬNULL(исходная.ДатаНачала, ПерваяСтрочка.ДатаНачала) КАК ДатаНачала,
|	ЕСТЬNULL(исходная.ДатаОкончания, ПерваяСтрочка.ДатаОкончания) КАК ДатаОкончания,
|	ЕСТЬNULL(исходная.ВидРесурсов, ПерваяСтрочка.ВидРесурсов) КАК ВидРесурсов,
|	ЕСТЬNULL(исходная.Ограничено, ПерваяСтрочка.Ограничено) КАК Ограничено,
|	ЕСТЬNULL(исходная.КоличествоВДень, ПерваяСтрочка.КоличествоВДень) КАК КоличествоВДень,
|	ЕСТЬNULL(исходная.КоличествоЗаСезон, ПерваяСтрочка.КоличествоЗаСезон) КАК КоличествоЗаСезон,
|	ЕСТЬNULL(исходная.НомерСтроки, ПерваяСтрочка.НомерСтроки) КАК НомерСтроки
|ИЗ
|	Исходная КАК исходная
|		ПОЛНОЕ СОЕДИНЕНИЕ ПерваяСтрочкаСостав КАК ПерваяСтрочка
|		ПО исходная.ВидРесурсов = ПерваяСтрочка.ВидРесурсов
|
|УПОРЯДОЧИТЬ ПО
|	НомерСтроки";


	мПериоды = ОхотаСервер.ПолучитьПериодыОхоты(Ссылка); 
	Периоды = мПериоды.Выгрузить();
	ТолькоСезонная = Истина;
	Для каждого стр из Периоды Цикл
		ТолькоСезонная = ТолькоСезонная И стр.ТолькоСезонная;
	КонецЦикла;		

	
	Запрос.Параметры.Вставить("ТолькоСезонная",ТолькоСезонная);
	Запрос.Параметры.Вставить("СезонОхоты",Ссылка.СезонОхоты);
	Запрос.Параметры.Вставить("ВидДичи",Ссылка.ВидДичи);
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("Дата",Ссылка.Дата);	
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	
	ОбластьРазрешение = Макет.ПолучитьОбласть("Разрешение");
	ТабДок.Очистить();
	
	ОбластьРазрешениеДляПечати = МакетДляПечати.ПолучитьОбласть("Разрешение");
	ТабДокДляПечати.Очистить();
	
	Пока Выборка.Следующий() Цикл
		СтруктураУточнений = Новый Структура;
		
		ОбластьРазрешение.Параметры.Заполнить(Выборка);
		ОбластьРазрешениеДляПечати.Параметры.Заполнить(Выборка);
		
		МестоОхоты = СокрЛП(Выборка.МестоОхоты);
		МестоОхотыСтроки = СтрЗаменить(МестоОхоты," ",Символы.ПС);
		ПереноситьПоГласным = Ложь;
		
		СтруктураУточнений = Новый Структура;
		
		Если ЭтоЛицеваяСторона Тогда
			ОграничениеПервойСтроки = 30;
			ОграничениеСледующихСтрок = 40;
		Иначе	
			ОграничениеПервойСтроки = 20;
			ОграничениеСледующихСтрок = 30;
		КонецЕсли;
		
		ДлинаСтроки = СтрДлина(МестоОхоты);
		
		Если  ДлинаСтроки > ОграничениеПервойСтроки Тогда
			СтрокаПервая = "";
			инд = 1;
			
			Пока Истина Цикл
				СледующаяСтрока = СокрЛП(СтрПолучитьСтроку(МестоОхотыСтроки,инд));
				Если НЕ ПустаяСтрока(СледующаяСтрока) Тогда
					Если СтрДлина(СтрокаПервая + ?(инд = 1,""," ") + СледующаяСтрока) > ОграничениеПервойСтроки Тогда
						Прервать;
					Иначе
						СтрокаПервая = СтрокаПервая + ?(инд = 1,""," ") + СледующаяСтрока;
					КонецЕсли;
				Иначе	
					Прервать;	
				КонецЕсли;
				инд = инд + 1;	
			КонецЦикла;
			
			Если ПереноситьПоГласным Тогда
				Гласные = Новый Массив;
				Гласные.Добавить("а");
				Гласные.Добавить("о");
				Гласные.Добавить("у");
				Гласные.Добавить("и");
				Гласные.Добавить("е");
				Гласные.Добавить("я");
					
				Для позпроб = 20 по ДлинаСтроки Цикл
					Если Гласные.Найти(Сред(МестоОхоты,позпроб,1)) <> Неопределено Тогда
						Прервать;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
			СтруктураУточнений.Вставить("МестоОхоты",СтрокаПервая);
			
			ВтораяСтрока = "";
			индвтстр = 1;
			Пока Истина Цикл
				СледующаяСтрока = СокрЛП(СтрПолучитьСтроку(МестоОхотыСтроки,инд));
				Если НЕ ПустаяСтрока(СледующаяСтрока) Тогда
					Если СтрДлина(ВтораяСтрока + ?(индвтстр = 1,""," ") + СледующаяСтрока) > ОграничениеСледующихСтрок Тогда
						Прервать;
					Иначе
						ВтораяСтрока = ВтораяСтрока + ?(индвтстр = 1,""," ") + СледующаяСтрока;
					КонецЕсли;
				Иначе
					Прервать;
				КонецЕсли;
				индвтстр = индвтстр + 1;
				инд = инд + 1;	
			КонецЦикла;

			Если НЕ ПустаяСтрока(ВтораяСтрока) Тогда
				СтруктураУточнений.Вставить("МестоОхотыСтр1",ВтораяСтрока);
			
			
				ТретьяСтрока = "";
				индтрстр = 1;
				Пока Истина Цикл
					СледующаяСтрока = СокрЛП(СтрПолучитьСтроку(МестоОхотыСтроки,инд));
					Если НЕ ПустаяСтрока(СледующаяСтрока) Тогда
						Если СтрДлина(ТретьяСтрока + ?(индтрстр = 1,""," ") + СледующаяСтрока) > ОграничениеСледующихСтрок Тогда
							Прервать;
						Иначе
							ТретьяСтрока = ТретьяСтрока + ?(индтрстр = 1,""," ") + СледующаяСтрока;
						КонецЕсли;
					Иначе
						Прервать;
					КонецЕсли;
					индтрстр = индтрстр + 1;
					инд = инд + 1;	
				КонецЦикла;
				Если НЕ ПустаяСтрока(ТретьяСтрока) Тогда
					СтруктураУточнений.Вставить("МестоОхотыСтр2",ТретьяСтрока);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		ПустаяДата = '00010101';
		
		Если НЕ Выборка.ДатаВыдачи = ПустаяДата Тогда
		
			Если Год(Выборка.ДатаВыдачи) >=2000 Тогда
				
				ГодВыдачи 	= Формат(Выборка.ДатаВыдачи,"ДФ = гг" ); 
				МесяцВыдачи = Формат(Выборка.ДатаВыдачи,"ДФ = ММ" );
			Иначе
				ГодВыдачи = "--";
				МесяцВыдачи = Формат(Выборка.ДатаВыдачи,"ДФ = ММ." ) + Формат(Выборка.ДатаВыдачи,"ДФ = гггг") + " г.";
			КонецЕсли;
			
			ДеньВыдачи	= Формат(Выборка.ДатаВыдачи,"ДФ = дд" ); 
			
			
			ОбластьРазрешение.Параметры.ГодВыдачи 					= ГодВыдачи;
			ОбластьРазрешение.Параметры.МесяцВыдачи 				= МесяцВыдачи;
			ОбластьРазрешение.Параметры.ДеньВыдачи 					= ДеньВыдачи;
			
			ОбластьРазрешениеДляПечати.Параметры.ГодВыдачи 			= ГодВыдачи;
			ОбластьРазрешениеДляПечати.Параметры.МесяцВыдачи 		= МесяцВыдачи;
			ОбластьРазрешениеДляПечати.Параметры.ДеньВыдачи 		= ДеньВыдачи;
		КонецЕсли;	
		
		Если НЕ Выборка.Дата = ПустаяДата Тогда
			
			ГодРегистрации 		= Формат(Выборка.Дата,"ДФ = гг" ); 
			МесяцРегистрации 	= Формат(Выборка.Дата,"ДФ = ММ" ); 
			ДеньРегистрации		= Формат(Выборка.Дата,"ДФ = дд" ); 

			
			ОбластьРазрешение.Параметры.ГодРегистрации 				= ГодРегистрации;
			ОбластьРазрешение.Параметры.МесяцРегистрации			= МесяцРегистрации;
			ОбластьРазрешение.Параметры.ДеньРегистрации 			= ДеньРегистрации;
			
			ОбластьРазрешениеДляПечати.Параметры.ГодРегистрации 	= ГодРегистрации;
			ОбластьРазрешениеДляПечати.Параметры.МесяцРегистрации	= МесяцРегистрации;
			ОбластьРазрешениеДляПечати.Параметры.ДеньРегистрации 	= ДеньРегистрации;
		КонецЕсли;
		
		
		
		////////////////////////
		/// исполнитель
		
		ОграничениеПоДлине = ?(ЭтоЛицеваяСторона,28,20);
		
		Если СтрДлина(Выборка.Исполнитель) > ОграничениеПоДлине Тогда
			
			Исполнитель = СокрЛП(Выборка.Исполнитель);
			
			ВсегоСимволов = СтрДлина(Исполнитель);
			Переносить = ?(ВсегоСимволов > 34,Истина,Ложь);
			
			Исполнитель = СтрЗаменить(Исполнитель," ",Символы.ПС);
			
			ФамилияИсполнителя = СтрПолучитьСтроку(Исполнитель,1);
			ИмяИсполнителя = СтрПолучитьСтроку(Исполнитель,2);
			ОтчествоИсполнителя = СтрПолучитьСтроку(Исполнитель,3);
			
			Если (СтрДлина(ФамилияИсполнителя) + СтрДлина(ИмяИсполнителя) + 1) > ОграничениеПоДлине Тогда
				Если Переносить Тогда
					
					Исполнитель = ФамилияИсполнителя + " " + ИмяИсполнителя;
					
					ЛеваяЧасть = Сред(Исполнитель,1,ОграничениеПоДлине);
					ПраваяЧасть = Сред(Исполнитель,(ОграничениеПоДлине + 1));
					
					Если СтрДлина(ПраваяЧасть) > 0 И СтрДлина(ПраваяЧасть) <=2 Тогда
						ЛеваяЧасть = Сред(Исполнитель,1,(ОграничениеПоДлине - 1));
						ПраваяЧасть = Сред(Исполнитель,ОграничениеПоДлине);
					КонецЕсли;	
					
					СтруктураУточнений.Вставить("Исполнитель",ЛеваяЧасть);
					СтруктураУточнений.Вставить("ИсполнительСтр1",ПраваяЧасть + " " + ОтчествоИсполнителя);
					
				Иначе	
					СтруктураУточнений.Вставить("Исполнитель",ФамилияИсполнителя);
					СтруктураУточнений.Вставить("ИсполнительСтр1",ИмяИсполнителя + " " + ОтчествоИсполнителя);
				КонецЕсли;
			Иначе
				СтруктураУточнений.Вставить("Исполнитель",ФамилияИсполнителя + " " + ИмяИсполнителя);
				СтруктураУточнений.Вставить("ИсполнительСтр1",ОтчествоИсполнителя);
			КонецЕсли;	
			
		КонецЕсли;
		
		Если СтруктураУточнений.Количество() > 0 Тогда
			ОбластьРазрешение.Параметры.Заполнить(СтруктураУточнений);
			ОбластьРазрешениеДляПечати.Параметры.Заполнить(СтруктураУточнений);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Найти(ПараметрыПечати.ИмяМакета,"ЛицеваяСторона") Тогда
		Выборка = Результат[6].Выбрать();
		
		а = 1;
		СтруктураПараметров = Новый Структура;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураПараметров.Вставить("Номер" + Строка(а),а);
			
			СтруктураПараметров.Вставить("ВидРесурсов" + Строка(а),Выборка.ВидРесурсов);
			
			Если НЕ Выборка.ДатаНачала = ПустаяДата Тогда
			
				ДатаНачала 		=  Формат(Выборка.ДатаНачала, 		"ДФ = 'дд.ММ гггг'");
				ДатаОкончания 	=  Формат(Выборка.ДатаОкончания, 	"ДФ = 'дд.ММ гггг'");
				
				СтруктураПараметров.Вставить("с" + Строка(а),ДатаНачала);
				СтруктураПараметров.Вставить("по" + Строка(а),ДатаОкончания);
			
			КонецЕсли;
			
			Если Выборка.Ограничено Тогда
				Если Выборка.КоличествоВДень > 0 Тогда
					колонка = "дд";
					Количество = Выборка.КоличествоВДень;
				Иначе
					колонка = "дс";
					Количество = Выборка.КоличествоЗаСезон;
				КонецЕсли;
				
				СтруктураПараметров.Вставить(колонка + Строка(а),Строка(Количество) + " шт");
			Иначе
				
				СтруктураПараметров.Вставить("дд" + Строка(а),"НЕОГР");
			КонецЕсли;			
			а = а + 1;
		КонецЦикла;
		ОбластьРазрешение.Параметры.Заполнить(СтруктураПараметров);
		ОбластьРазрешениеДляПечати.Параметры.Заполнить(СтруктураПараметров);
	КонецЕсли;
	
	
	
	ТабДок.Вывести(ОбластьРазрешение);
	
	ТабДок.ПолеСверху 		= 6.5;
	ТабДок.ПолеСнизу 		= 5.5;
	ТабДок.ПолеСлева 		= 5.5;
	ТабДок.ПолеСправа 		= 0;
	
	ТабДокДляПечати.Вывести(ОбластьРазрешениеДляПечати);
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Если ЭтоЛицеваяСторона Тогда	
		ТабДокДляПечати.ПолеСверху 		= 46.5;
		ТабДокДляПечати.ПолеСнизу 		= 5.5;
		ТабДокДляПечати.ПолеСлева 		= 9.84;
		ТабДокДляПечати.ПолеСправа 		= 0;
	Иначе
		ТабДокДляПечати.ПолеСверху 		= 46.5;
		ТабДокДляПечати.ПолеСнизу 		= 5.5;
		ТабДокДляПечати.ПолеСлева 		= 5.5;
		ТабДокДляПечати.ПолеСправа 		= 5;
		
	КонецЕсли;
	
	
	
КонецПроцедуры
